package com.example.moonmingcalendar;

import java.util.ArrayList;

public class GetMainEvent {
    ArrayList<MainEvent> arrayList = new ArrayList<>();
    ArrayList<ChineseEvent> ChineseList = new ArrayList<>();
    String[] dmy;

    public GetMainEvent(String day){
//        eng
//              1
        arrayList.add(new MainEvent("วันปีใหม่", "วันปีใหม่สากล เป็นวันเริ่มนับ 1 ใหม่ในปีพุทธศักราช และคริสตศักราช ตรงกับวันที่ 1 มกราคม ของทุกๆ ปีโดยยึดวันขึ้นปีใหม่ตาม ปฏิทินเกรโกเรียน ซึ่งเป็นปฏิทินที่ใช้อย่างแพร่หลายในประเทศตะวันตก", "NO", "1", "1"));
//              2
        arrayList.add(new MainEvent("วันวาเลนไทน์", "วันแห่งความรัก วันที่ 14 กุมภาพันธ์ของทุกปี ถูกจัดให้เป็นวันหยุดเพื่อเป็นเกียรติแต่เทพเจ้าจูโน ผู้เป็นจักรพรรดินีแห่งเทพเจ้าโรมัน นอกจากนี้แล้วพระองค์ยังทรงเป็นเทพเจ้าแห่งอิสตรีเพศและการแต่งงาน", "NO", "14", "2"));
//              12
        arrayList.add(new MainEvent("วันคริสต์มาสอีฟ", "วันคริสต์มาสอีฟ เป็นเย็นแรกของวันคริสต์มาส ซึ่งมีการเฉลิมฉลองเพื่อระลึกถึง การประสูติของพระเยซู", "NO", "25", "12"));
        arrayList.add(new MainEvent("วันคริสต์มาส", "วันคริสต์มาส เป็นการฉลองวันประสูติของพระเยซูผู้เป็นศาสดาสูงสุดของชาวคริสต์ทั่วโลก เป็นวันฉลองที่มีความสำคัญ และมีความหมายมากที่สุดวันหนึ่งของชาวคริสต์", "NO", "25", "12"));
//        thai
//              4
        arrayList.add(new MainEvent("วันจักรี", "วันที่ระลึกพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกฯ ปฐมบรมราชวงศ์จักรี เสด็จปราบดาภิเษกขึ้นครองราชย์เป็นกษัตริย์แห่งราชวงศ์จักรี", "NO", "6", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย", "NO", "13", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย\"", "NO", "14", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย\"", "NO", "15", "4"));
//              5
        arrayList.add(new MainEvent("วันฉัตรมงคล", "วพระราชพิธีฉลองพระเศวตฉัตร เป็นวันที่มีพระราชพิธีฉลองพระเศวตฉัตร ซึ่งจะกระทำในวันคล้ายวันบรมราชาภิเษก ซึ่งเป็นโบราณราชประเพณีที่พระมหากษัตริย์ไทยได้รับการสถาปนาอย่างเป็นทางการ ด้วยการถวายน้ำอภิเษก โดยแบ่งออกเป็น 2 พระราชพิธีสำคัญคือ 1.พระราชพิธีบรมราชาภิเษก และ 2.พระราชพิธีเฉลิมพระราชมณเฑียร", "NO", "4", "5"));
        arrayList.add(new MainEvent("วันพืชมงคล", "พระราชพิธิพืชมงคลจรดพระนังคัลแรกนาขวัญ เป็นพิธีกรรม 2 พิธีที่กระทำร่วมกัน คือ 1.พิธีพืชมงคล และ2.พิธีแรกนาขวัญ", "NO", "10", "5"));
//              6
        arrayList.add(new MainEvent("วันเฉลิมฯ พระราชินี", "วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง ตรงกับวันที่ 12 สิงหาคม ของทุกปี เป็นวันคล้ายวันพระราชสมภพ", "NO", "3", "6"));
//              7
        arrayList.add(new MainEvent("วันเฉลิมฯ ร.10", "ววันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณ พระวชิรเกล้าเจ้าอยู่หัว ตรงกับวันที่ 28 กรกฎาคม ของทุกปี เป็นวันคล้ายวันพระราชสมภพ", "NO", "28", "7"));
//              8
        arrayList.add(new MainEvent("วันแม่แห่งชาติ", "วันแม่แห่งชาติ ในประเทศไทย ตรงกับวันที่ 12 สิงหาคม ของทุกปี ซึ่งตรงกับวันคล้ายวันพระราชสมภพของสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง", "NO", "12", "8"));
//              9
        arrayList.add(new MainEvent("วันมหิดล", " วันคล้ายวันสวรรคต ของสมเด็จพระมหิตลาธิเบศร อดุลยเดชวิกรม พระบรมราชชนก (สมเด็จฯ เจ้าฟ้ามหิดลอดุลเดช กรมหลวงสงขลานครินทร์) พระบิดาแห่งการแพทย์แผนปัจจุบันและการสาธารณสุขของไทย", "NO", "24", "9"));
//              10
        arrayList.add(new MainEvent("วันคล้ายวันสวรรคต ร.9", "วันคล้ายวันสวรรคต พระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร", "NO", "13", "10"));
//              12
        arrayList.add(new MainEvent("วันคล้ายวันเฉลิมฯ ร.9", "วันคล้ายวันเฉลิมพระชนมพรรษาของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร (รัชกาลที่ 9) เป็นวันคล้ายวันพระราชสมภพ และเป็นวันพ่อแห่งชาติ", "NO", "5", "12"));
        arrayList.add(new MainEvent("วันรัฐธรรมนูญ", "เป็นวันที่ระลึกถึงโอกาสที่ พระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว (รัชกาลที่ 7) ที่ทรงพระกรุณาโปรดเกล้าฯ พระราชทานรัฐธรรมนูญแห่งราชอาณาจักรสยาม พุทธศักราช 2475 ซึ่งเป็นรัฐธรรมนูญถาวรฉบับแรกของประเทศไทย", "NO", "10", "12"));
        arrayList.add(new MainEvent("วันพ่อแห่งชาติ", "วันพ่อแห่งชาติ ในประเทศไทย ตรงกับวันที่ 5 ธันวาคม ของทุกปี ซึ่งตรงกับวันคล้ายวันพระราชสมภพของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร", "NO", "5", "12"));
        arrayList.add(new MainEvent("วันสิ้นปี", " วันสุดท้ายของปีซึ่งตรงกับวันที่ 31 ธันวาคม ตามปฏิทินกริกอเรียน ทางการกำหนดให้เป็นวันหยุดราชการ เป็นคืนที่จะมีการจัดงานนับถอยหลังเพื่อเข้าสู่วันขึ้นปีใหม่ในเวลาเที่ยงคืนตามเมืองใหญ่ทั่วโลกซึ่งเกิดขึ้นไม่พร้อมกัน", "NO", "31", "12"));

//       chinese 2021
        ChineseList.add(new ChineseEvent("วันไหว้ส่งเสด็จเจ้าขึ้นสวรรค์","วันส่งเจ้าขึ้นสวรรค์ หรือที่ภาษาจีนเรียกว่า เซ้งเจี่ยที โดยจะตรงกับวันที่ 24 เดือน 12 ของจีน ซึ่งเป็นกำหนดเวลาที่เจ้าเตาจะต้องขึ้นไปรายงานความดี-ชั่วของคนที่อยู่ในบ้านแต่ละหลังให้เง็กเซียนฮ่องเต้บนสรวงสวรรค์ได้ทรงทราบ ทว่าในปัจจุบันนี้คนส่วนใหญ่ได้หันไปไหว้เทพต่าง ๆ แทนการไหว้เจ้าเตาแล้ว แต่ไม่ว่าจะไหว้เทพหรือเจ้าเตา ก็ยังถือเป็นการส่งเจ้าขึ้นสวรรค์เหมือนกัน \\nสิ่งของที่ต้องเตรียมในพิธีไหว้ส่งเจ้าขึ้นสวรรค์นั้นขึ้นอยู่กับความเชื่อของแต่ละบ้าน โดยส่วนใหญ่มักประกอบด้วย \\n- กระถางธูปบรรจุผงธูป- แพแดงและหางนกยูงใหม่ \\n- ธูป 3 หรือ 5 ดอก \\n- แจกันใส่ดอกไม้สดหรือพวงมาลัย \\n- กระทงใส่ค้อซี \\n- ผลไม้ 5 อย่าง \\n- น้ำชา 5 ถ้วย \\n- เสื้อผ้าเทพเจ้า \\n","NO","5","2","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้รับเสด็จเทพเจ้าแห่งโชคลาภไฉ่ซิ้งเอี้ย","วันไหว้เทพเจ้าโชคลาภ ไฉ่ซิงเอี้ย เทพเจ้าแห่งโชคลาภ นับเป็นเทพเจ้าที่ลูกหลานชาวจีนให้ความสำคัญมากที่สุด ในการเริ่มเข้าสู่ปีนักษัตรใหม่ในช่วงตรุษจีน และจะได้รับการกราบไหว้เป็นเทพองค์แรก โดยเชื่อว่า ไฉ่ซิงเอี้ย จะช่วยดลบันดาลความมั่งมีศรีสุข ร่ำรวยโชคลาภ เงินทองไหลมาเทมา \\nของไหว้ไฉ่ซิงเอี้ย \\n- รูปภาพหรือรูปปั้น เทพเจ้าไฉ่ซิงเอี้ย \\n- แจกันดอกไม้สด 1 คู่ \\n- เทียนแดง 1 คู่ \\n- กระถางธูป 1 ใบ \\n- ธูป 3 ดอก ต่อ 1 คน \\n- ผลไม้ 5 สี 5 อย่าง แล้วแต่กำลังทรัพย์ (เช่น องุ่น แอปเปิล กล้วย สาลี่ และส้ม) \\n- สาคูแดงต้มสุก 5 ถ้วย \\n- น้ำชา น้ำสมุนไพร 5 ถ้วย \\n- ข้าวสวย 5 ถ้วย \\n- ขนมจันอับ 1 จาน \\n- เจฉ่าย 5 อย่าง (เช่น เห็ดหอม เห็ดหูหนู ดอกไม้จีน วุ้นเส้น และฟองเต้าหู้) \\n- หงิ่งเตี๋ย 12 ชุด \\n- กิมหงิ่งเต้า 1 คู่ \\n- เทียงเถ้าจี๊ 1 ชุด \\n-กระดาษสีเขียว 1 แผ่น (เทียบเชิญสีเขียว) \\n- เทียบเชิญแดง 1 แผ่น \\n","NO","11","2","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้สิ้นปี","การไหว้วันสิ้นปี หรือ ก๊วยนี้โจ่ย เป็นช่วงคาบเกี่ยวระหว่างสารทที่ 1 กับสารทที่ 8 ถือเป็นวันที่สำคัญวันหนึ่ง วันไหว้วันสุดท้ายของเดือน 12 ก่อนเริ่มปีใหม่ของจีน ตามหลักการไหว้บรรพบุรุษจะตั้งโต๊ะเครื่องบวงสรวงไหว้ในช่วงเช้า โดยเริ่มไหว้จากพระพุทธ ปึงเถ้ากง เทพเจ้าที่ตั้งบูชาในบ้าน ฟ้าดิน เจ้าที่ และบรรพบุรุษ ส่วนการไหว้สัมพเวสีจะไหว้สุดท้าย โดยวางเครื่องบวงสรวงไหว้กับพื้นดิน","NO","11","2","2021"));
        ChineseList.add(new ChineseEvent("วันตรุษจีน","วันตรุษจีนเป็นหนึ่งในเทศกาลที่สำคัญที่สุดของชาวจีน ถือเป็นวันขึ้นปีใหม่ตามปฎิทินจีน ชาวจีนทุกคนให้ความสำคัญกับวันนี้อย่างมาก มีการหยุดงานเป็นเวลายาว โรงเรียนสถาบันการศึกษาปิดเทอม (ปิดเรียนฤดูหนาว)ในช่วงนี้ เหลือเพียงแต่บางอาชีพที่ต้องทำหน้าที่พิเศษ ที่ไม่สามารถหยุดงานได้ ในวันตรุษจีนหน่วยงานห้างร้านต่างจะหยุดงานเป็นเวลา 3-4 วัน เพื่อตระเตรียมจัดงานปีใหม่นี้ \\nอาหารไหว้เจ้า ตรุษจีน \\n- เม็ดบัว มีความหมายถึง การมีลูกหลานที่เป็นชาย \\n- เกาลัด มีความหมายถึง เงิน \\n- สาหร่ายดำ คำของมันออกเสียงคล้าย ความร่ำรวย \\n- เต้าหู้หมักที่ทำจากถั่วแห้ง คำของมันออกเสียงคล้าย เต็มไปด้วยความร่ำรวย และ ความสุข \\n- หน่อไม้ คำของมันออกเสียงคล้าย คำอวยพรให้ทุกอย่างเต็มไปด้วยความสุข เต้าหู้ที่ทำจากถั่วสดนั้นจะไม่นำมารวมกับอาหารในวันนี้เนื่องจากสีขาวซึ่งเป็นสีแห่งโชคร้าย สำหรับปีใหม่และหมายถึงการไว้ทุกข์ \\n- ปลาทั้งตัว เป็นตัวแทนแห่งการอยู่ร่วมกันและความอุดม-สมบรูณ์ \\n- ไก่ สำหรับความเจริญก้าวหน้า ซึ่งไก่นั้นจะต้องยังมีหัว หางและเท้าอยู่ เพื่อเป็นการแสดงให้เห็นถึงความสมบูรณ์ \\n- เส้นหมี่ ไม่ควรตัดเนื่องจากหมายถึงชีวิตที่ยืนยาว \\n","NO","12","2","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้รับเจ้ากลับจากสวรรค์","ซวันไหว้รับเจ้ากลับจากสวรรค์ ไหว้รับเหล่าเอี๊ยเหลาะที หรือ ซิ้งเลาะที โดยจะต้องกับวันที่ 4 เดือน 1 ตามปฏิทินจัทรคติจีน ชาวจีนเชื่อว่าเทพเจ้าที่เราได้ไหว้ส่งขึ้นสวรรค์ไป จะกลับลงมาสู่โลกมนุษย์ พร้อมรับคำสั่งจากสวรรค์นำคำอวยพร โชคลาภ กลับลงมาด้วย \\nสิ่งของที่ต้องเตรียมในพิธี เช่น ส้ม ขนมจันอับ กระดาษไหว้เจ้า เป็นต้น","NO","15","2","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันเกิดเทพเจ้าไฉ่ซิ้งเอี้ย ปางบู๊","จ้าวกงหมิง","NO","16","2","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันสมภพองค์เทพยดาฟ้าดิน หยี้วหวังต้าตี้","ทีกงแซ","NO","20","2","2021"));
        ChineseList.add(new ChineseEvent("ไหว้เทศกาลชาวนา-เทศกาลโคมไฟ","ง่วงเซียวโจ่ย","NO","26","2","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันประสูติพระโพธิสัตว์กวนอิม","","NO","31","3","2021"));
        ChineseList.add(new ChineseEvent("วันเช็งเม้ง","","NO","4","4","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันประสูติองค์เซวียนเทียนสร้างตี้","คล้ายวันประสูติองค์เซวียนเทียนสร้างตี้","NO","14","4","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันประสูติเจ้าแม่ทับทิม","เทียนโหวเซี้ยบ้อ","NO","4","5","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันประสูติองค์ถานกงต้าเซียนเสิ้ง ","องค์ยุวเทพท่ามกงเยี่ย","NO","19","5","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้บ๊ะจ่าง","ตวนอู่เจี๋ย","NO","14","6","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันสำเร็จมรรคผลพระโพธิสัตว์กวนอิม","","NO","28","7","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันสมภพองค์ไท้สร้างเหลาจวิน","","NO","8","8","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันประสูติเทพเจ้ากวนอูฯ","กว้านอี้กง","NO","8","8","2021"));
        ChineseList.add(new ChineseEvent("วันสารทจีน","จงหยวนเจี๋ย","NO","22","8","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันเกิดเจ้าแม่ลิ้มกอเหนี่ยว ","ชุนเจี๋ย","NO","3","9","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้พระจันทร์","จงชิวเจี๋ย","NO","21","9","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันเกิดเทพเจ้าไฉ่ซิ้งเอี้ย ปางบุ๋น","ปี่กาน","NO","29","9","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","6","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","7","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","8","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","9","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","10","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","11","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","12","10","2021"));
        ChineseList.add(new ChineseEvent("เทศกาลกินเจ","","NO","13","10","2021"));
        ChineseList.add(new ChineseEvent("วันประสูติเทพเจ้านาจาซาไท้จื้อฯ","","NO","14","10","2021"));
        ChineseList.add(new ChineseEvent("วันคล้ายวันออกบวชพระโพธิสัตว์กวนอิม","","NO","24","10","2021"));
        ChineseList.add(new ChineseEvent("วันไหว้ขนมบัวลอย","ตังโจ่ย","NO","21","12","2021"));

        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","13","1","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","12","2","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","13","3","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","12","4","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","12","5","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","10","6","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","10","7","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","8","8","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","7","9","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","6","10","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","5","11","2021"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","4","12","2021"));

        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","27","1","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","26","2","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","27","3","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","26","4","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","26","5","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","24","6","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","24","7","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","22","8","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","21","9","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","20","10","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","19","11","2021"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","18","12","2021"));

//       chinese 2020
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","25","1","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","23","2","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","24","3","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","23","4","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","23","5","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","21","6","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","21","7","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","19","8","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","17","9","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","17","10","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","15","11","2020"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","15","12","2020"));

        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","9","1","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","8","2","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","8","3","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","7","4","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","7","5","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","6","6","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","5","7","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","4","8","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","2","9","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","1","10","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","31","10","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","29","11","2020"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","29","12","2020"));

//       chinese 2022
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","3","1","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","1","2","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","3","3","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","1","4","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","1","5","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","30","5","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","29","6","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","29","7","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","27","8","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","26","9","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","25","10","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","24","11","2022"));
        ChineseList.add(new ChineseEvent("วันชิวอิก","วันพระจีน","NO","23","12","2022"));

        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","17","1","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","15","2","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","17","3","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","15","4","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","15","5","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","13","6","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","13","7","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","12","8","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","10","9","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","10","10","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","8","11","2022"));
        ChineseList.add(new ChineseEvent("วันจับโหงว","วันพระจีน","NO","8","12","2022"));


        dmy = day.split("/");
    }

    public ArrayList<String> getEventListName(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add(arrayList.get(i).getName());
            }
        }
        for (int j=0;j<ChineseList.size();j++){
            if (dmy[0].equals(ChineseList.get(j).getDay()) && dmy[1].equals(ChineseList.get(j).getMonth()) && dmy[2].equals(ChineseList.get(j).getYear())){
                eventLst.add(ChineseList.get(j).getName());
            }
        }
        return eventLst;
    }

    public ArrayList<String> getEventListDetail(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add(arrayList.get(i).getDetail());
            }
        }
        for (int j=0;j<ChineseList.size();j++){
            if (dmy[0].equals(ChineseList.get(j).getDay()) && dmy[1].equals(ChineseList.get(j).getMonth()) && dmy[2].equals(ChineseList.get(j).getYear())){
                eventLst.add(ChineseList.get(j).getDetail());
            }
        }

        return eventLst;
    }

    public ArrayList<String> getEventListN(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add("");
            }
        }
        for (int j=0;j<ChineseList.size();j++){
            if (dmy[0].equals(ChineseList.get(j).getDay()) && dmy[1].equals(ChineseList.get(j).getMonth()) && dmy[2].equals(ChineseList.get(j).getYear())){
                eventLst.add("");
            }
        }
        return eventLst;
    }

}
