package com.example.moonmingcalendar;

import java.util.ArrayList;

public class GetMainEvent {
    ArrayList<MainEvent> arrayList = new ArrayList<>();
    String[] dmy;

    public GetMainEvent(String day){
//        eng
//              1
        arrayList.add(new MainEvent("วันปีใหม่", "วันปีใหม่สากล เป็นวันเริ่มนับ 1 ใหม่ในปีพุทธศักราช และคริสตศักราช ตรงกับวันที่ 1 มกราคม ของทุกๆ ปีโดยยึดวันขึ้นปีใหม่ตาม ปฏิทินเกรโกเรียน ซึ่งเป็นปฏิทินที่ใช้อย่างแพร่หลายในประเทศตะวันตก", "NO", "1", "1"));
//              2
        arrayList.add(new MainEvent("วันวาเลนไทน์", "วันแห่งความรัก วันที่ 14 กุมภาพันธ์ของทุกปี ถูกจัดให้เป็นวันหยุดเพื่อเป็นเกียรติแต่เทพเจ้าจูโน ผู้เป็นจักรพรรดินีแห่งเทพเจ้าโรมัน นอกจากนี้แล้วพระองค์ยังทรงเป็นเทพเจ้าแห่งอิสตรีเพศและการแต่งงาน", "NO", "14", "2"));
//              12
        arrayList.add(new MainEvent("วันคริสต์มาสอีฟ", "วันคริสต์มาสอีฟ เป็นเย็นแรกของวันคริสต์มาส ซึ่งมีการเฉลิมฉลองเพื่อระลึกถึง การประสูติของพระเยซู", "NO", "25", "12"));
        arrayList.add(new MainEvent("วันคริสต์มาส", "วันคริสต์มาส เป็นการฉลองวันประสูติของพระเยซูผู้เป็นศาสดาสูงสุดของชาวคริสต์ทั่วโลก เป็นวันฉลองที่มีความสำคัญ และมีความหมายมากที่สุดวันหนึ่งของชาวคริสต์", "NO", "25", "12"));
//        thai
//              4
        arrayList.add(new MainEvent("วันจักรี", "วันที่ระลึกพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกฯ ปฐมบรมราชวงศ์จักรี เสด็จปราบดาภิเษกขึ้นครองราชย์เป็นกษัตริย์แห่งราชวงศ์จักรี", "NO", "6", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย", "NO", "13", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย\"", "NO", "14", "4"));
        arrayList.add(new MainEvent("วันสงกรานต์", "เป็นวันขึ้นปีใหม่ไทย ซึ่งเป็นประเพณีของประเทศไทย ลาว กัมพูชา พม่า ชนกลุ่มน้อยชาวไตแถบเวียดนาม และมนฑลยูนานของจีน รวมถึงศรีลังกา และประเทศทางตะวันออกของประเทศอินเดีย สันนิษฐานกันว่า ประเพณีสงกรานต์นั้นได้รับวัฒนธรรมมาจากเทศกาลโฮลีในอินเดีย\"", "NO", "15", "4"));
//              5
        arrayList.add(new MainEvent("วันฉัตรมงคล", "วพระราชพิธีฉลองพระเศวตฉัตร เป็นวันที่มีพระราชพิธีฉลองพระเศวตฉัตร ซึ่งจะกระทำในวันคล้ายวันบรมราชาภิเษก ซึ่งเป็นโบราณราชประเพณีที่พระมหากษัตริย์ไทยได้รับการสถาปนาอย่างเป็นทางการ ด้วยการถวายน้ำอภิเษก โดยแบ่งออกเป็น 2 พระราชพิธีสำคัญคือ 1.พระราชพิธีบรมราชาภิเษก และ 2.พระราชพิธีเฉลิมพระราชมณเฑียร", "NO", "4", "5"));
        arrayList.add(new MainEvent("วันพืชมงคล", "พระราชพิธิพืชมงคลจรดพระนังคัลแรกนาขวัญ เป็นพิธีกรรม 2 พิธีที่กระทำร่วมกัน คือ 1.พิธีพืชมงคล และ2.พิธีแรกนาขวัญ", "NO", "10", "5"));
//              6
        arrayList.add(new MainEvent("วันเฉลิมฯ พระราชินี", "วันเฉลิมพระชนมพรรษาสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง ตรงกับวันที่ 12 สิงหาคม ของทุกปี เป็นวันคล้ายวันพระราชสมภพ", "NO", "3", "6"));
//              7
        arrayList.add(new MainEvent("วันเฉลิมฯ ร.10", "ววันเฉลิมพระชนมพรรษาพระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณ พระวชิรเกล้าเจ้าอยู่หัว ตรงกับวันที่ 28 กรกฎาคม ของทุกปี เป็นวันคล้ายวันพระราชสมภพ", "NO", "28", "7"));
//              8
        arrayList.add(new MainEvent("วันแม่แห่งชาติ", "วันแม่แห่งชาติ ในประเทศไทย ตรงกับวันที่ 12 สิงหาคม ของทุกปี ซึ่งตรงกับวันคล้ายวันพระราชสมภพของสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ พระบรมราชชนนีพันปีหลวง", "NO", "12", "8"));
//              9
        arrayList.add(new MainEvent("วันมหิดล", " วันคล้ายวันสวรรคต ของสมเด็จพระมหิตลาธิเบศร อดุลยเดชวิกรม พระบรมราชชนก (สมเด็จฯ เจ้าฟ้ามหิดลอดุลเดช กรมหลวงสงขลานครินทร์) พระบิดาแห่งการแพทย์แผนปัจจุบันและการสาธารณสุขของไทย", "NO", "24", "9"));
//              10
        arrayList.add(new MainEvent("วันคล้ายวันสวรรคต ร.9", "วันคล้ายวันสวรรคต พระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร", "NO", "13", "10"));
//              12
        arrayList.add(new MainEvent("วันคล้ายวันเฉลิมฯ ร.9", "วันคล้ายวันเฉลิมพระชนมพรรษาของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร (รัชกาลที่ 9) เป็นวันคล้ายวันพระราชสมภพ และเป็นวันพ่อแห่งชาติ", "NO", "5", "12"));
        arrayList.add(new MainEvent("วันรัฐธรรมนูญ", "เป็นวันที่ระลึกถึงโอกาสที่ พระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว (รัชกาลที่ 7) ที่ทรงพระกรุณาโปรดเกล้าฯ พระราชทานรัฐธรรมนูญแห่งราชอาณาจักรสยาม พุทธศักราช 2475 ซึ่งเป็นรัฐธรรมนูญถาวรฉบับแรกของประเทศไทย", "NO", "10", "12"));
        arrayList.add(new MainEvent("วันพ่อแห่งชาติ", "วันพ่อแห่งชาติ ในประเทศไทย ตรงกับวันที่ 5 ธันวาคม ของทุกปี ซึ่งตรงกับวันคล้ายวันพระราชสมภพของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช บรมนาถบพิตร", "NO", "5", "12"));
        arrayList.add(new MainEvent("วันสิ้นปี", " วันสุดท้ายของปีซึ่งตรงกับวันที่ 31 ธันวาคม ตามปฏิทินกริกอเรียน ทางการกำหนดให้เป็นวันหยุดราชการ เป็นคืนที่จะมีการจัดงานนับถอยหลังเพื่อเข้าสู่วันขึ้นปีใหม่ในเวลาเที่ยงคืนตามเมืองใหญ่ทั่วโลกซึ่งเกิดขึ้นไม่พร้อมกัน", "NO", "31", "12"));


        dmy = day.split("/");
    }
    public String getMainActivity(){
        String eventLst = "";
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst += arrayList.get(i).getName()+"\n";
            }
        }
        return eventLst;
    }

    public ArrayList<String> getEventListName(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add(arrayList.get(i).getName());
            }
        }
        return eventLst;
    }

    public ArrayList<String> getEventListDetail(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add(arrayList.get(i).getDetail());
            }
        }
        return eventLst;
    }

    public ArrayList<String> getEventListN(){
        ArrayList<String> eventLst = new ArrayList<>();
        for (int i=0;i<arrayList.size();i++){
            if (dmy[0].equals(arrayList.get(i).getDay()) && dmy[1].equals(arrayList.get(i).getMonth())){
                eventLst.add("");
            }
        }
        return eventLst;
    }

}
